Repository: Sainaif/wp-hidden-iframe
Catalog: languages/secure-hash-embed-manager-*.po
Languages: pl_pl

source: Secure Embed Manager
pl_pl: Menedżer Bezpiecznych Osadzeń

source: Secure Embed
pl_pl: Bezpieczne Osadzanie

source: Video Manager
pl_pl: Menedżer Wideo

source: Database Management
pl_pl: Zarządzanie Bazą Danych

source: Plugin Settings
pl_pl: Ustawienia Wtyczki

source: Settings
pl_pl: Ustawienia

source: Are you sure you want to delete this video?
pl_pl: Czy na pewno chcesz usunąć to wideo?

source: This will permanently delete all videos. Are you sure?
pl_pl: To trwale usunie wszystkie wideo. Czy jesteś pewien?

source: This will replace all existing videos. Continue?
pl_pl: To zastąpi wszystkie istniejące wideo. Kontynuować?

source: Embed code copied to clipboard!
pl_pl: Kod osadzenia skopiowany do schowka!

source: Failed to copy. Please try manually selecting the text.
pl_pl: Kopiowanie nie powiodło się. Spróbuj ręcznie zaznaczyć tekst.

source: Please wait...
pl_pl: Proszę czekać...

source: An error occurred. Please try again.
pl_pl: Wystąpił błąd. Spróbuj ponownie.

source: Please fill out all fields.
pl_pl: Proszę wypełnić wszystkie pola.

source: Please enter a valid URL.
pl_pl: Proszę wprowadzić prawidłowy adres URL.

source: You do not have sufficient permissions to access this page.
pl_pl: Nie masz wystarczających uprawnień, aby uzyskać dostęp do tej strony.

source: Video added successfully!
pl_pl: Wideo dodano pomyślnie!

source: Failed to add video. Please check the URL is valid.
pl_pl: Nie udało się dodać wideo. Sprawdź, czy adres URL jest prawidłowy.

source: Video updated successfully!
pl_pl: Wideo zaktualizowano pomyślnie!

source: Failed to update video. Please check the URL is valid.
pl_pl: Nie udało się zaktualizować wideo. Sprawdź, czy adres URL jest prawidłowy.

source: Video deleted successfully!
pl_pl: Wideo usunięto pomyślnie!

source: Failed to delete video.
pl_pl: Nie udało się usunąć wideo.

source: Add and manage secure video links with hashed IDs to hide real URLs.
pl_pl: Dodawaj i zarządzaj bezpiecznymi linkami do wideo z haszowanymi ID, aby ukryć prawdziwe adresy URL.

source: Edit Video
pl_pl: Edytuj Wideo

source: Admin Name (Internal)
pl_pl: Nazwa Admina (Wewnętrzna)

source: Display Name (Public)
pl_pl: Nazwa Wyświetlana (Publiczna)

source: Video URL
pl_pl: Adres URL Wideo

source: Update Video
pl_pl: Aktualizuj Wideo

source: Cancel
pl_pl: Anuluj

source: Add New Video
pl_pl: Dodaj Nowe Wideo

source: Add Video
pl_pl: Dodaj Wideo

source: Video List (%d)
pl_pl: Lista Wideo (%d)

source: Search videos...
pl_pl: Szukaj wideo...

source: Search
pl_pl: Szukaj

source: Clear
pl_pl: Wyczyść

source: Sort: Oldest First
pl_pl: Sortuj: Najstarsze Najpierw

source: Sort: Newest First
pl_pl: Sortuj: Najnowsze Najpierw

source: No videos found.
pl_pl: Nie znaleziono wideo.

source: Admin Name
pl_pl: Nazwa Admina

source: Display Name
pl_pl: Nazwa Wyświetlana

source: Unique ID
pl_pl: Unikalny ID

source: Actions
pl_pl: Akcje

source: Copy Embed
pl_pl: Kopiuj Kod

source: Edit
pl_pl: Edytuj

source: Delete
pl_pl: Usuń

source: %s item
pl_pl: %s element

source: How to Use
pl_pl: Jak Używać

source: To embed a video on your site, use this HTML structure:
pl_pl: Aby osadzić wideo na swojej stronie, użyj tej struktury HTML:

source: Replace "vid_XXXXXXXXXX" with the unique ID from the table above, and "Video Name" with your desired link text.
pl_pl: Zastąp "vid_XXXXXXXXXX" unikalnym ID z powyższej tabeli, a "Nazwa Wideo" wybranym tekstem linku.

source: Current database contains %d videos.
pl_pl: Aktualna baza danych zawiera %d wideo.

source: Download Backup (JSON)
pl_pl: Pobierz Kopię Zapasową (JSON)

source: Download all videos as a JSON backup file. This file can be used to restore your data later.
pl_pl: Pobierz wszystkie wideo jako plik kopii zapasowej JSON. Ten plik może być użyty do późniejszego przywrócenia danych.

source: Download Database as JSON
pl_pl: Pobierz Bazę Danych jako JSON

source: Restore from Backup (JSON)
pl_pl: Przywróć z Kopii Zapasowej (JSON)

source: WARNING:
pl_pl: OSTRZEŻENIE:

source: This will DELETE all current videos and replace them with the backup data. This action cannot be undone!
pl_pl: To USUNIE wszystkie obecne wideo i zastąpi je danymi z kopii zapasowej. Tej operacji nie można cofnąć!

source: Select JSON File
pl_pl: Wybierz Plik JSON

source: Confirmation
pl_pl: Potwierdzenie

source: Type exactly:
pl_pl: Wpisz dokładnie:

source: Restore from Backup
pl_pl: Przywróć z Kopii Zapasowej

source: Import from CSV
pl_pl: Importuj z CSV

source: Import videos from a CSV file. The CSV should have columns: db_name, embed_name, link
pl_pl: Importuj wideo z pliku CSV. Plik CSV powinien zawierać kolumny: db_name, embed_name, link

source: Duplicate links will be skipped. New unique IDs will be generated automatically.
pl_pl: Duplikaty linków zostaną pominięte. Nowe unikalne ID zostaną wygenerowane automatycznie.

source: CSV Format Example:
pl_pl: Przykład Formatu CSV:

source: Select CSV File
pl_pl: Wybierz Plik CSV

source: Reset Database
pl_pl: Resetuj Bazę Danych

source: DANGER:
pl_pl: NIEBEZPIECZEŃSTWO:

source: This will DROP the database table and recreate it empty. ALL videos will be permanently deleted. This action cannot be undone!
pl_pl: To USUNIE tabelę bazy danych i utworzy ją ponownie pustą. WSZYSTKIE wideo zostaną trwale usunięte. Tej operacji nie można cofnąć!

source: Tips
pl_pl: Wskazówki

source: Always create a backup before performing restore or reset operations.
pl_pl: Zawsze twórz kopię zapasową przed wykonaniem operacji przywracania lub resetowania.

source: JSON backups preserve unique IDs, while CSV imports generate new ones.
pl_pl: Kopie zapasowe JSON zachowują unikalne ID, podczas gdy import CSV generuje nowe.

source: CSV import skips duplicate URLs automatically to prevent data duplication.
pl_pl: Import CSV automatycznie pomija duplikaty adresów URL, aby zapobiec duplikacji danych.

source: Database reset is useful for starting fresh or troubleshooting issues.
pl_pl: Reset bazy danych jest przydatny do rozpoczęcia od nowa lub rozwiązywania problemów.

source: Incorrect confirmation text. Restore cancelled.
pl_pl: Nieprawidłowy tekst potwierdzenia. Przywracanie anulowane.

source: Please select a JSON file to restore.
pl_pl: Proszę wybrać plik JSON do przywrócenia.

source: Please upload a valid JSON file.
pl_pl: Proszę przesłać prawidłowy plik JSON.

source: Please select a CSV file to import.
pl_pl: Proszę wybrać plik CSV do importu.

source: Please upload a valid CSV file.
pl_pl: Proszę przesłać prawidłowy plik CSV.

source: Incorrect confirmation text. Reset cancelled.
pl_pl: Nieprawidłowy tekst potwierdzenia. Resetowanie anulowane.

source: Database reset successfully. All videos have been deleted.
pl_pl: Baza danych zresetowana pomyślnie. Wszystkie wideo zostały usunięte.

source: Failed to reset database.
pl_pl: Nie udało się zresetować bazy danych.

source: Configure plugin behavior and appearance.
pl_pl: Skonfiguruj zachowanie i wygląd wtyczki.

source: Security Settings
pl_pl: Ustawienia Bezpieczeństwa

source: Block DevTools
pl_pl: Blokuj DevTools

source: Enabled
pl_pl: Włączone

source: Disabled
pl_pl: Wyłączone

source: Enable browser DevTools detection and blocking on the frontend. When enabled, users who open DevTools will be redirected.
pl_pl: Włącz wykrywanie i blokowanie narzędzi deweloperskich przeglądarki na froncie. Po włączeniu użytkownicy, którzy otworzą DevTools, zostaną przekierowani.

source: Redirect URL
pl_pl: Adres URL Przekierowania

source: URL to redirect users when DevTools are detected. Default is your site's 404 page.
pl_pl: Adres URL do przekierowania użytkowników, gdy wykryto DevTools. Domyślnie jest to strona 404 Twojej witryny.

source: Interface Settings
pl_pl: Ustawienia Interfejsu

source: Input Field Width
pl_pl: Szerokość Pól Wprowadzania

source: pixels
pl_pl: pikseli

source: Width of input fields in the admin interface (50-2000 pixels).
pl_pl: Szerokość pól wprowadzania w interfejsie administratora (50-2000 pikseli).

source: Show Edit/Delete Buttons
pl_pl: Pokaż Przyciski Edytuj/Usuń

source: Show
pl_pl: Pokaż

source: Hide
pl_pl: Ukryj

source: Show or hide edit and delete buttons in the video list table.
pl_pl: Pokaż lub ukryj przyciski edycji i usuwania w tabeli listy wideo.

source: Videos Per Page
pl_pl: Wideo Na Stronę

source: Number of videos to display per page in the video list.
pl_pl: Liczba wideo do wyświetlenia na stronie w liście wideo.

source: Default Sort Order
pl_pl: Domyślna Kolejność Sortowania

source: Oldest First (Ascending)
pl_pl: Najstarsze Najpierw (Rosnąco)

source: Newest First (Descending)
pl_pl: Najnowsze Najpierw (Malejąco)

source: Default sorting order for the video list.
pl_pl: Domyślna kolejność sortowania dla listy wideo.

source: Save Settings
pl_pl: Zapisz Ustawienia

source: Settings saved successfully!
pl_pl: Ustawienia zapisane pomyślnie!

source: Plugin Information
pl_pl: Informacje o Wtyczce

source: Version
pl_pl: Wersja

source: Author
pl_pl: Autor

source: License
pl_pl: Licencja

source: Language
pl_pl: Język

source: Polish
pl_pl: Polski

source: English
pl_pl: Angielski

source: Security check failed
pl_pl: Sprawdzenie bezpieczeństwa nie powiodło się

source: Video ID is required
pl_pl: ID wideo jest wymagane

source: Invalid video ID format
pl_pl: Nieprawidłowy format ID wideo

source: Video not found
pl_pl: Nie znaleziono wideo

source: Invalid JSON data
pl_pl: Nieprawidłowe dane JSON

source: Successfully imported %d videos
pl_pl: Pomyślnie zaimportowano %d wideo

source: CSV file is empty
pl_pl: Plik CSV jest pusty

source: Imported %1$d videos, skipped %2$d duplicates/errors
pl_pl: Zaimportowano %1$d wideo, pominięto %2$d duplikatów/błędów

source: Cannot unserialize singleton
pl_pl: Nie można deserializować singletona
